/**
 * 
 */
package com.ifeng.iRecommend.zhanzh.newHotPredict;

/**
 * <PRE>
 * 作用 : 
 *   
 * 使用 : 
 *   
 * 示例 :
 *   
 * 注意 :
 *   
 * 历史 :
 * -----------------------------------------------------------------------------
 *        VERSION          DATE           BY       CHANGE/COMMENT
 * -----------------------------------------------------------------------------
 *          1.0          2015年7月23日        zhanzh          create
 * -----------------------------------------------------------------------------
 * </PRE>
 */

public class BaiduHotNewsCrawler {

}
