package com.ifeng.iRecommend.featureEngineering;

import static org.junit.Assert.*;

import java.util.ArrayList;
import java.util.Arrays;
import java.util.List;

import org.junit.Before;
import org.junit.Ignore;
import org.junit.Test;

import com.ifeng.iRecommend.featureEngineering.dataStructure.itemf;
import com.ifeng.iRecommend.featureEngineering.databaseOperation.IKVOperationv2;


public class IndexOperationTest {
	IndexOperation ob = null;
	String tablename = "appitemdb";
	@Before
	public void setUp() throws Exception {
		ob = IndexOperation.getInstance();
	}

	@Ignore
	public void testQueryFromSolr() {
		IKVOperationv2 ikvop = new IKVOperationv2(tablename);
		itemf item = ikvop.queryItemF("1270679", "c");
		ArrayList<itemf> list = ob.queryFromSolr(item);
		assertNotNull(list);
		ikvop.close();
		
		itemf testItem = new itemf();
//		testItem.setDocType("self");
		testItem.setTitle("女出纳仿董事长签字吞8000万 购买6辆豪车及名包");
		testItem.setSplitTitle("《_w 夜行_v 书生_k 》_w 今天_t 的_u 新闻_n 图_k");
		testItem.setSplitContent("广州日报_x 讯_k  _w （_w 记者_n  _w 李斌_nr ）_w  _w 广州恒大淘宝_x 在_p 夏季_t 转会_k 窗_n 关闭_v 前_f 签_v 下_f 罗比尼奥_x ，_w 但_k 这个_h 消息_n 对_p 目前_t 的_u 球队_x 没有_v 任何_r 帮助_v ，_w 斯科拉里_x 依然_v 只能_d 带着_v 残缺_v 阵容_n 远_k 赴_k 辽宁_x 。_w 今晚_t 7时_t 35分_t ，_w 广州恒大淘宝_x 将_d 在_p 辽宁_x 盘锦_x 奥体_nz 中心_k 对阵_v 辽宁宏运_x 。_w \n\n_w 　_w 　_w 辽宁宏运_x 目前_t 在_p 积分榜_n 的_u 排名_x 不_h 佳_a ，_w 身处_v 降级_v 区_k 边缘_s 。_w 然而_c 这_r 并_d 不是_n 一支_mq 被_p 忽视_v 的_u 对手_n ，_w 辽宁宏运_x 在_p 二次_mq 转会_k 市场_x 引进_v 了_u 罗马尼亚_x 射手_n 埃里克_ns ，_w 同时_k 引进_v 的_u 还有_v 此前_t 效力_h 上海申花_x 的_u 保罗·恩里克_x ，_w 后者_n 在_p 中超联赛_nz 已_h 证明_k 了_u 自己_h 的_u 能力_n 。_w 辽宁宏运_x 在_p 本_r 赛季_n 首_k 次_q 遭遇_h 广州恒大淘宝_x 时_n ，_w 在_p 天河_n 体育场_n 被_p 卡纳瓦罗_x 的_u 球队_x 打出_v 6_mq 比_k 1_mq 的_u 高分_n ，_w 但_k 时过境迁_l ，_w 如今_t 辽宁宏运_x 有着_v 完成_v 保级_v 任务_n 的_u 决心_h ，_w 也_d 能_v 反省_v 此前_t 的_u 战术_n 失误_v ，_w 他们_r 在_p 主场_n 必然_n 将_d 防守_x 反击_x 打_k 得_u 更加_d 坚决_a 。_w \n\n_w 　_w 　_w 斯科拉里_x 面临_v 的_u 依然_v 是_v 无_v 人_r 可用_v 的_u 局面_n ，_w 高拉特_x 在_p 下周_t 才_n 能_v 复出_v ，_w 埃尔克森_x 的_u 伤情_n 可能_v 延续_v 到_v 月底_t 。_w 唯一_b 值得_h 庆幸_a 的_u 是_v ，_w 在_p 经过_v 上_v 轮_v 的_u 临时_d 登场_v 后_f ，_w 保利尼奥_x 的_u 状态_n 看起来_d 可以_v 完成_v 90分钟_mq 的_u 比赛_k ，_w 如今_t 保利尼奥_x 和_c 金英权_x 是_v 斯科拉里_x 在_p 阵容_n 中_n 能_v 使用_v 的_u 外援_n 。_w 而_h 国内_s 球员_n 方面_n ，_w 郑智_x 上_f 轮_v 的_u 红牌_x 使_v 其_u 缺席_v ，_w 郜林_x 从_p 伤病_n 中_n 走出_v 可以_v 一战_x 。_w 广州恒大淘宝_x 在_p 本场_r 比赛_v 的_u 进攻_v 线_k ，_w 依然_v 仰仗_v 于汉超_x 、_w 郑龙_x 与_p 郜林_x 三_m 人_h 。_w “_w 我_r 还_h 没_h 看到_v 罗比尼奥_x ，_w 现在_t 的_u 球员_n 是_v 郜林_x 、_w 黄博文_x 、_w 于汉超_x 等_u 。_w 埃尔克森_x 、_w 张琳芃_x 、_w 廖力生_x 这些_r 球员_n 赶快_d 复出_v ，_w 这_r 是_v 我_r 现在_t 要_v 考虑_v 的_u 。_w ”_w 斯科拉里_x 说_v 。_w 去_h 东北_k 比赛_v 对于_p 斯科拉里_x 而言_u 并_d 没有_v 太_d 大_k 问题_n ，_w 尽管_h 他_r 和_c 球队_x 都_h 乘坐_v 大巴_e 从_p 沈阳_x 前往_v 盘锦_x 。_w 面对_v 保级_v 动力_n 十足_h 的_u 对手_n ，_w 斯科拉里_x 说_v ：_w “_w 我们_r 打_v 任何_r 对手_n 都_n 没有_v 压力_n ，_w 我们_r 需要_v 做_v 的_u 是_v 拿下_v 明天_t 的_u 比赛_k 。_w ”_w \n\n_w 　_w 　_w 罗比_nr 踢_v 亚冠_x  _w 并非_v 没_v 机会_n \n\n_w 　_w 　_w 值得一提的是_nz 罗比尼奥_x ，_w 巴西人_n 目前_t 还_h 未_k 抵达_v 广州_x ，_w 但_k 他_r 的_u 签约_v 有着_v 新_n 的_u 说法_k 。_w 有_v 消息_n 称_k 罗比尼奥_x 的_u 合同_n 中_n 有_v 条款_n 说明_h ，_w 这位_mq 巴西_x 球员_n 只能_d 征战_v 中超_x 而_h 无法_d 登陆_v 亚冠_x 。_w 但_k 记者_n 从_p 相关_v 渠道_n 了解_v 到_v ，_w 这个_h 合同_n 条款_n 的_u 存在_k 仅_k 是_v 规避_v 一些_n 风险_n 。_w “_w 在_p 谈判_v 的_u 时候_n 提出_v 过_u 这个_h 想法_n ，_w 就是_k ‘_w 可能_h 让_v 罗比尼奥_x 只_k 踢_v 中超_x ’_w ，_w 希望_k 罗比尼奥_x 能_v 接受_v 这个_h 条件_n 。_w 罗比尼奥_x 最终_b 答应_v 了_u 。_w 这个_h 条件_n 虽然_c 看起来_d 有些_h 苛刻_k ，_w 但_k 却_k 并_h 不是_n 说_v 他_r 只能_d 踢_v 中超_x 。_w ”_w \n\n_w 　_w 　_w 知情人士_nz 表示_k 说_v ，_w “_w 条款_n 的_u 存在_k 是_v 一种_mq 安抚_v ，_w 因为_c 球队_x 肯定_k 只有_c 三名_mq 非_h 亚_h 外援_n 报名_v 亚冠_x 。_w 按照_v 罗比尼奥_x 的_u 身价_n 和_c 名气_n ，_w 如果_c 他_r 没_v 法_v 报名_v 亚冠_x ，_w 可能_h 会_v 引发_v 一些_h 麻烦_k 。_w 所以_c 就是_k 希望_v 他_r 能够_v 理解_v ‘_w 可能_h ’_w 会_v 出现_v 的_u 情况_n ，_w 而_h 不_h 会_v 因此_c 产生_v 不满_v 。_w ”_w \n\n_w 　_w 　_w 记者_n 了解_v 到_v ，_w 对_p 罗比尼奥_x “_w 可能_h 不_h 打_k 亚冠_x ”_w 的_u 说明_v 只是_k 个_q “_w 提醒_v ”_w ，_w 以_p 防止_v 诸如_v 外援_n 对_p 落选_v 失望_a 并且_c 心_k 生_v 不满_v 的_u 情况_n 出现_v ，_w 这_r 在_p 广州恒大淘宝_x 此前_t 的_u 亚冠_x 经历_k 中_n 并_d 不是_n 没有_v 发生_v 过_v 的_u 事情_n ，_w 所以_c 对_p 罗比尼奥_x 的_u 提早_h 说明_h ，_w 就是_k 为了_p 规避_v 恶劣_a 后果_n 的_u 出现_v 。_w 实际上_d 广州恒大淘宝_x 亚冠_x 名单_n 选择_v 中_n 有着_v 高拉特_x 、_w 保利尼奥_x 、_w 埃尔克森_x 、_w 罗比尼奥_x 四_k 人_h ，_w 势必_d 有_v 一_m 人_h 会_v 落选_v 名单_n 。_w 俱乐部_x 也_d 不_h 可能_h 在_p 关键_n 的_u 时候_n 限制_v 罗比尼奥_x 参加_v 亚冠_x ，_w 而_h 给_k 其他_r 三名_mq 外援_n 吃_k 定心丸_n 。_w 如果_c 真_d 按照_v 传言_k 中_f 那样_mq 让_v 罗比尼奥_x 远离_v 亚冠_x ，_w 那么_k 一旦_k 在_p 8月份_t 有_v 一名_mq 外援_n 重伤_k 或者_h 状态_n 不_h 佳_a ，_w 那么_k 对_p 罗比尼奥_x 的_u 限制_v 岂不_d 是_v 搬_v 起_v 石头_x 砸_v 自己_r 的_u 脚_n 。_w 所以_c 四名_mq 外援_n 之间_f 的_u 名额_n 竞争_v 依然_v 存在_k ，_w 只是_k 他们_r 都_n 需要_nz 在_p 一个多_n 月_n 时间_n 里_q 用_v 自己_r 的_u 表现_k 去_h 说服_v 斯科拉里_x 。_w \n");
		String[] feature = {"","et","0.5","井江南", "s", "1", "武当山", "et", "0.1", "鄱阳湖", "et", "0.1", "景德镇", "et", "0.1", "梅兰芳", "et", "0.1", "颐和园", "et", "0.1", "五台山", "et", "0.1", "十二生肖", "et", "0.1", "黄帝", "et", "0.1", "巢湖", "et", "0.1", "论语", "et", "0.1", "大帝", "et", "0.1", "孟子", "et", "0.1", "道教", "et", "0.1", "屈原", "et", "0.1", "太湖", "et", "0.1", "牡丹", "et", "0.1", "菊花", "et", "0.1", "敦煌", "et", "0.1", "庐山", "et", "0.1", "张旭", "et", "0.1", "天台", "et", "0.1", "华山", "et", "0.1", "老子", "et", "0.1", "大名", "et", "0.1", "大理", "et", "0.1", "黄山", "et", "0.1", "西湖区", "et", "0.1", "元始天尊", "et", "0.1", "灵岩寺", "et", "0.1", "都庞岭", "et", "0.1", "吕洞宾", "et", "0.1", "飞虹塔", "et", "0.1", "张果老", "et", "0.1", "王安石", "et", "0.1", "陶然亭", "et", "0.1", "玉泉寺", "et", "0.1", "安溪县", "et", "0.1", "欧阳修", "et", "0.1", "祁门县", "et", "0.1", "雁荡山", "et", "0.1", "拙政园", "et", "0.1", "岳麓书院", "et", "0.1", "韩湘子", "et", "0.1", "爱晚亭", "et", "0.1", "大观楼", "et", "0.1", "地震碑林", "et", "0.1", "嵩阳书院", "et", "0.1", "广胜寺", "et", "0.1", "滕王阁", "et", "0.1", "白鹿洞书院", "et", "0.1", "何仙姑", "et", "0.1", "应天书院", "et", "0.1", "栖霞寺", "et", "0.1", "避暑山庄", "et", "0.1", "齐云山", "et", "0.1", "国清寺", "et", "0.1", "嵩岳寺塔", "et", "0.1", "铁拐李", "et", "0.1", "醉翁亭", "et", "0.1", "麦积山石窟", "et", "0.1", "莫高窟", "et", "0.1", "杭州西湖", "et", "0.1", "龙门石窟", "et", "0.1", "洞庭湖", "et", "0.1", "岳阳楼", "et", "0.1", "黄鹤楼", "et", "0.1", "赵州桥", "et", "0.1", "青城山", "et", "0.1", "广济桥", "et", "0.1", "嵩岳寺", "et", "0.1", "洛阳桥", "et", "0.1", "佛教", "et", "0.1", "孙子", "et", "0.1", "埃及", "et", "0.1", "佛山", "et", "0.1", "甘肃", "et", "0.1", "地震", "et", "0.1", "灵宝", "et", "0.1", "韩愈", "et", "0.1", "应县", "et", "0.1", "江陵", "et", "0.1", "少皞", "et", "0.1", "颛顼", "et", "0.1", "金寨", "et", "0.1", "都匀", "et", "0.1", "留园", "et", "0.1", "衡山", "et", "0.1", "云山", "et", "0.1", "炎帝", "et", "0.1", "祁门", "et", "0.1", "嵩山", "et", "0.1", "恒山", "et", "0.1", "曲阜", "et", "0.1", "上清", "et", "0.1", "苏洵", "et", "0.1", "孔庙", "et", "0.1", "洪洞", "et", "0.1", "嵇康", "et", "0.1", "歙县", "et", "0.1", "西昌", "et", "0.1", "塔山", "et", "0.1", "安县", "et", "0.1", "李耳", "et", "0.1", "庄子", "et", "0.1", "苏辙", "et", "0.1", "五常", "et", "0.1", "碑林", "et", "0.1", "伏羲", "et", "0.1", "殷墟", "et", "0.1", "德化", "et", "0.1", "正宫", "et", "0.1", "君山", "et", "0.1", "苏州", "et", "0.1", "大方", "et", "0.1", "贵州", "et", "0.1", "山西", "et", "0.1", "江西", "et", "0.1", "云南", "et", "0.1", "陕西", "et", "0.1", "福建", "et", "0.1", "安徽", "et", "0.1", "河北", "et", "0.1", "湖北", "et", "0.1", "河南", "et", "0.1", "湖南", "et", "0.1", "四川", "et", "0.1", "印度", "et", "0.1", "兄弟", "et", "0.1", "江苏", "et", "0.1", "山东", "et", "0.1", "浙江", "et", "0.1", "广东", "et", "0.1", "法国", "et", "0.1", "传统文化", "x", "-1.0", "罗汉", "x", "-0.5", "中国", "x", "-0.1", "易经", "x", "-0.1", "尚书", "x", "-0.1", "八仙", "x", "-0.1", "江苏苏州", "x", "-0.1", "云南昆明", "x", "-0.1", "湖南长沙", "x", "-0.1", "浙江杭州", "x", "-0.1", "湖南岳阳", "x", "-0.1", "苏轼", "x", "-0.1", "寒冰", "x", "-0.1", "天尊", "x", "-0.1", "卢沟桥", "x", "-0.1", "喜怒哀乐", "x", "-0.1", "儿童", "x", "-0.1", "道家", "x", "-0.1", "高翔", "x", "-0.1", "琉璃", "x", "-0.1", "文化遗产", "x", "-0.1", "摩羯", "x", "-0.1", "五彩", "x", "-0.1", "双鱼", "x", "-0.1", "小肠", "x", "-0.1", "红茶", "x", "-0.1", "李白", "x", "-0.1", "天蝎", "x", "-0.1", "节气", "x", "-0.1", "大肠", "x", "-0.1", "古镇", "x", "-0.1", "扫墓", "x", "-0.1", "珊瑚", "x", "-0.1", "膀胱", "x", "-0.1", "中秋", "x", "-0.1", "巨蟹", "x", "-0.1", "晚清", "x", "-0.1", "粽子", "x", "-0.1", "书院", "x", "-0.1", "儒家", "x", "-0.1", "汉字", "x", "-0.1", "汉口", "x", "-0.1", "中天", "x", "-0.1", "珍珠", "x", "-0.1", "金银", "x", "-0.1", "汤显祖", "x", "-0.1", "安徽六安", "x", "-0.1", "荀慧生", "x", "-0.1", "观音菩萨", "x", "-0.1", "普贤菩萨", "x", "-0.1", "长生殿", "x", "-0.1", "十八罗汉", "x", "-0.1", "八股文", "x", "-0.1", "河南商丘", "x", "-0.1", "西厢记", "x", "-0.1", "沉思罗汉", "x", "-0.1", "四大石窟", "x", "-0.1", "安徽黄山", "x", "-0.1", "郑板桥", "x", "-0.1", "江西龙虎山", "x", "-0.1", "河北承德", "x", "-0.1", "纵横家", "x", "-0.1", "朱仙镇", "x", "-0.1", "铁观音", "x", "-0.1", "东海南海", "x", "-0.1", "江西南昌", "x", "-0.1", "牡丹亭", "x", "-0.1", "扬州八怪", "x", "-0.1", "河南信阳", "x", "-0.1", "降龙罗汉", "x", "-0.1", "竹林七贤", "x", "-0.1", "山西大同", "x", "-0.1", "山东泰山", "x", "-0.1", "孟姜女", "x", "-0.1", "江苏南京", "x", "-0.1", "河南登封", "x", "-0.1", "民间传说", "x", "-0.1", "信阳毛尖", "x", "-0.1", "崇圣寺", "x", "-0.1", "张道陵", "x", "-0.1", "武夷岩茶", "x", "-0.1", "甘肃天水", "x", "-0.1", "梁山伯与祝英台", "x", "-0.1", "景德镇窑", "x", "-0.1", "西安碑林", "x", "-0.1", "浙江普陀山", "x", "-0.1", "洪泽湖", "x", "-0.1", "贺知章", "x", "-0.1", "西湖龙井", "x", "-0.1", "柳宗元", "x", "-0.1", "插茱萸", "x", "-0.1", "程砚秋", "x", "-0.1", "六安瓜片", "x", "-0.1", "河南洛阳", "x", "-0.1", "安徽九华山", "x", "-0.1", "曹国舅", "x", "-0.1", "四川峨眉山", "x", "-0.1", "台湾高雄", "x", "-0.1", "龙泉窑", "x", "-0.1", "四大名旦", "x", "-0.1", "湖北武汉", "x", "-0.1", "玉皇大帝", "x", "-0.1", "湖心亭", "x", "-0.1", "八大菜系", "x", "-0.1", "君山银针", "x", "-0.1", "碧螺春", "x", "-0.1", "福建漳州", "x", "-0.1", "黄庭坚", "x", "-0.1", "四川菜", "x", "-0.1", "文殊菩萨", "x", "-0.1", "王实甫", "x", "-0.1", "八月十五", "x", "-0.1", "陕西西安", "x", "-0.1", "地藏王菩萨", "x", "-0.1", "山东菏泽", "x", "-0.1", "李适之", "x", "-0.1", "书法", "x", "-0.1", "雕塑", "x", "-0.1", "绘画", "x", "-0.1", "官场", "x", "-0.1", "天后", "x", "-0.1", "八卦", "x", "-0.1", "戏剧", "x", "-0.1", "古代", "x", "-0.1", "湘绣", "x", "-0.1", "尼姑", "x", "-0.1", "蜀绣", "x", "-0.1", "戌狗", "x", "-0.1", "左传", "x", "-0.1", "登高", "x", "-0.1", "冬至", "x", "-0.1", "白羊", "x", "-0.1", "荀子", "x", "-0.1", "北岳", "x", "-0.1", "毛峰", "x", "-0.1", "五谷", "x", "-0.1", "许仙", "x", "-0.1", "七宝", "x", "-0.1", "辰龙", "x", "-0.1", "紫微", "x", "-0.1", "南岳", "x", "-0.1", "孝经", "x", "-0.1", "巳蛇", "x", "-0.1", "酉鸡", "x", "-0.1", "赏月", "x", "-0.1", "寅虎", "x", "-0.1", "神农", "x", "-0.1", "三清", "x", "-0.1", "阮籍", "x", "-0.1", "未羊", "x", "-0.1", "五帝", "x", "-0.1", "丑牛", "x", "-0.1", "卯兔", "x", "-0.1", "鬼节", "x", "-0.1", "五岳", "x", "-0.1", "金农", "x", "-0.1", "中岳", "x", "-0.1", "苏绣", "x", "-0.1", "三皇", "x", "-0.1", "越调", "x", "-0.1", "亥猪", "x", "-0.1", "砗磲", "x", "-0.1", "成公", "x", "-0.1", "列子", "x", "-0.1", "刘鹗", "x", "-0.1", "女娲", "x", "-0.1", "玛瑙", "x", "-0.1", "儒教", "x", "-0.1", "墨家", "x", "-0.1", "子鼠", "x", "-0.1", "申猴", "x", "-0.1", "名园", "x", "-0.1", "午马", "x", "-0.1", "婴儿", "x", "-0.1", "小说", "x", "-0.1", "妇女", "x", "-0.1", "夫妇", "x", "-0.1", "牛宫毗", "nr", "-0.1", "方缓方", "nr", "-0.1", "崔宗之", "nr", "-0.1", "罗汉探手罗汉托塔罗汉", "nr", "-0.1", "尚小云", "nr", "-0.1", "吴沃尧", "nr", "-0.1", "严君平", "nr", "-0.1", "公羊传", "nr", "-0.1", "羊因达", "nr", "-0.1", "真达罗", "nr", "-0.1", "胥清明", "nr", "-0.1", "关汉卿", "nr", "-0.1", "禹余天", "nr", "-0.1", "宫寺千", "nr", "-0.1", "钟离权", "nr", "-0.1", "汪士慎", "nr", "-0.1", "李宝嘉", "nr", "-0.1", "李方鹰", "nr", "-0.1", "方奇方", "nr", "-0.1", "马珊底", "nr", "-0.1", "龙安底", "nr", "-0.1", "吴子", "nr", "-0.1", "窦娥", "nr", "-0.1", "焦遂", "nr", "-0.1", "洪升", "nr", "-0.1", "苏晋", "nr", "-0.1", "张灯", "nr", "-0.1", "师婆", "nr", "-0.1", "李琎", "nr", "-0.1", "铁册", "nr", "-0.1", "曾巩", "nr", "-0.1", "元日", "nr", "-0.1", "吕宫", "nr", "-0.1", "铁床", "nr", "-0.1", "释迦", "nr", "-0.1", "曾朴", "nr", "-0.1", "铁磨", "nr", "-0.1", "王戎", "nr", "-0.1", "金木", "nr", "-0.1", "刘伶", "nr", "-0.1", "杜罗", "nr", "-0.1", "李鱓", "nr", "-0.1", "罗聘", "nr", "-0.1", "勾陈", "nr", "-0.1", "诗经", "nz", "-0.1", "礼记", "nz", "-0.1", "三山", "nz", "-0.1", "天秤", "nz", "-0.1", "老残游记", "nz", "-0.1", "孽海花", "nz", "-0.1", "戏剧文学", "nz", "-0.1", "文中子", "nz", "-0.1", "七大", "nz", "-0.1", "黄慎", "nz", "-0.1", "人日", "nz", "-0.1", "绢扇", "nz", "-0.1", "寒食", "nz", "-0.1", "黍稷", "nz", "-0.1", "南吕", "nz", "-0.1", "盖山", "nz", "-0.1", "指事", "nz", "-0.1", "青黄", "nz", "-0.1", "中元", "nz", "-0.1", "地狱", "n", "-0.1", "名山", "n", "-0.1", "祖父", "n", "-0.1", "狮子", "n", "-0.1", "曾祖父", "n", "-0.1", "女子", "n", "-0.1", "大面", "n", "-0.1", "五脏", "n", "-0.1", "心肝", "n", "-0.1", "鬼神", "n", "-0.1", "襁褓", "n", "-0.1"};
		testItem.setFeatures(new ArrayList<String>(Arrays.asList(feature)));
		list = ob.queryFromSolr(testItem);
		assertNotNull(list);
		
		itemf testItem1 = new itemf();
//		testItem.setDocType("self");
		testItem1.setTitle("山东农村数十名越南新娘集体出逃：诈骗百万，3人获刑");
		testItem1.setSplitTitle("山东_x 农村_x 数十名_mq 越南新娘_x 集体_n 出逃_v ：_w 诈骗_x 百万_m ，_w 3_mq 人_h 获_v 刑_k");
		list = ob.queryFromSolr(testItem1);
		
	}
	
	@Ignore
	public void testAddDocToSolrByUsingClient(){
		IKVOperationv2 ikvop = new IKVOperationv2(tablename);
		itemf item = ikvop.queryItemF("584", "c");
		ikvop.close();
//		ob.addDocToSolrByUsingClient(item);

		itemf testItem = new itemf();
		testItem.setID("test");
		testItem.setDocType("self");
		testItem.setTitle("《夜行书生》今天的新闻图");
		testItem.setSplitTitle("《_w 夜行_v 书生_k 》_w 今天_t 的_u 新闻_n 图_k");
		testItem.setSplitContent("广州日报_x 讯_k  _w （_w 记者_n  _w 李斌_nr ）_w  _w 广州恒大淘宝_x 在_p 夏季_t 转会_k 窗_n 关闭_v 前_f 签_v 下_f 罗比尼奥_x ，_w 但_k 这个_h 消息_n 对_p 目前_t 的_u 球队_x 没有_v 任何_r 帮助_v ，_w 斯科拉里_x 依然_v 只能_d 带着_v 残缺_v 阵容_n 远_k 赴_k 辽宁_x 。_w 今晚_t 7时_t 35分_t ，_w 广州恒大淘宝_x 将_d 在_p 辽宁_x 盘锦_x 奥体_nz 中心_k 对阵_v 辽宁宏运_x 。_w \n\n_w 　_w 　_w 辽宁宏运_x 目前_t 在_p 积分榜_n 的_u 排名_x 不_h 佳_a ，_w 身处_v 降级_v 区_k 边缘_s 。_w 然而_c 这_r 并_d 不是_n 一支_mq 被_p 忽视_v 的_u 对手_n ，_w 辽宁宏运_x 在_p 二次_mq 转会_k 市场_x 引进_v 了_u 罗马尼亚_x 射手_n 埃里克_ns ，_w 同时_k 引进_v 的_u 还有_v 此前_t 效力_h 上海申花_x 的_u 保罗·恩里克_x ，_w 后者_n 在_p 中超联赛_nz 已_h 证明_k 了_u 自己_h 的_u 能力_n 。_w 辽宁宏运_x 在_p 本_r 赛季_n 首_k 次_q 遭遇_h 广州恒大淘宝_x 时_n ，_w 在_p 天河_n 体育场_n 被_p 卡纳瓦罗_x 的_u 球队_x 打出_v 6_mq 比_k 1_mq 的_u 高分_n ，_w 但_k 时过境迁_l ，_w 如今_t 辽宁宏运_x 有着_v 完成_v 保级_v 任务_n 的_u 决心_h ，_w 也_d 能_v 反省_v 此前_t 的_u 战术_n 失误_v ，_w 他们_r 在_p 主场_n 必然_n 将_d 防守_x 反击_x 打_k 得_u 更加_d 坚决_a 。_w \n\n_w 　_w 　_w 斯科拉里_x 面临_v 的_u 依然_v 是_v 无_v 人_r 可用_v 的_u 局面_n ，_w 高拉特_x 在_p 下周_t 才_n 能_v 复出_v ，_w 埃尔克森_x 的_u 伤情_n 可能_v 延续_v 到_v 月底_t 。_w 唯一_b 值得_h 庆幸_a 的_u 是_v ，_w 在_p 经过_v 上_v 轮_v 的_u 临时_d 登场_v 后_f ，_w 保利尼奥_x 的_u 状态_n 看起来_d 可以_v 完成_v 90分钟_mq 的_u 比赛_k ，_w 如今_t 保利尼奥_x 和_c 金英权_x 是_v 斯科拉里_x 在_p 阵容_n 中_n 能_v 使用_v 的_u 外援_n 。_w 而_h 国内_s 球员_n 方面_n ，_w 郑智_x 上_f 轮_v 的_u 红牌_x 使_v 其_u 缺席_v ，_w 郜林_x 从_p 伤病_n 中_n 走出_v 可以_v 一战_x 。_w 广州恒大淘宝_x 在_p 本场_r 比赛_v 的_u 进攻_v 线_k ，_w 依然_v 仰仗_v 于汉超_x 、_w 郑龙_x 与_p 郜林_x 三_m 人_h 。_w “_w 我_r 还_h 没_h 看到_v 罗比尼奥_x ，_w 现在_t 的_u 球员_n 是_v 郜林_x 、_w 黄博文_x 、_w 于汉超_x 等_u 。_w 埃尔克森_x 、_w 张琳芃_x 、_w 廖力生_x 这些_r 球员_n 赶快_d 复出_v ，_w 这_r 是_v 我_r 现在_t 要_v 考虑_v 的_u 。_w ”_w 斯科拉里_x 说_v 。_w 去_h 东北_k 比赛_v 对于_p 斯科拉里_x 而言_u 并_d 没有_v 太_d 大_k 问题_n ，_w 尽管_h 他_r 和_c 球队_x 都_h 乘坐_v 大巴_e 从_p 沈阳_x 前往_v 盘锦_x 。_w 面对_v 保级_v 动力_n 十足_h 的_u 对手_n ，_w 斯科拉里_x 说_v ：_w “_w 我们_r 打_v 任何_r 对手_n 都_n 没有_v 压力_n ，_w 我们_r 需要_v 做_v 的_u 是_v 拿下_v 明天_t 的_u 比赛_k 。_w ”_w \n\n_w 　_w 　_w 罗比_nr 踢_v 亚冠_x  _w 并非_v 没_v 机会_n \n\n_w 　_w 　_w 值得一提的是_nz 罗比尼奥_x ，_w 巴西人_n 目前_t 还_h 未_k 抵达_v 广州_x ，_w 但_k 他_r 的_u 签约_v 有着_v 新_n 的_u 说法_k 。_w 有_v 消息_n 称_k 罗比尼奥_x 的_u 合同_n 中_n 有_v 条款_n 说明_h ，_w 这位_mq 巴西_x 球员_n 只能_d 征战_v 中超_x 而_h 无法_d 登陆_v 亚冠_x 。_w 但_k 记者_n 从_p 相关_v 渠道_n 了解_v 到_v ，_w 这个_h 合同_n 条款_n 的_u 存在_k 仅_k 是_v 规避_v 一些_n 风险_n 。_w “_w 在_p 谈判_v 的_u 时候_n 提出_v 过_u 这个_h 想法_n ，_w 就是_k ‘_w 可能_h 让_v 罗比尼奥_x 只_k 踢_v 中超_x ’_w ，_w 希望_k 罗比尼奥_x 能_v 接受_v 这个_h 条件_n 。_w 罗比尼奥_x 最终_b 答应_v 了_u 。_w 这个_h 条件_n 虽然_c 看起来_d 有些_h 苛刻_k ，_w 但_k 却_k 并_h 不是_n 说_v 他_r 只能_d 踢_v 中超_x 。_w ”_w \n\n_w 　_w 　_w 知情人士_nz 表示_k 说_v ，_w “_w 条款_n 的_u 存在_k 是_v 一种_mq 安抚_v ，_w 因为_c 球队_x 肯定_k 只有_c 三名_mq 非_h 亚_h 外援_n 报名_v 亚冠_x 。_w 按照_v 罗比尼奥_x 的_u 身价_n 和_c 名气_n ，_w 如果_c 他_r 没_v 法_v 报名_v 亚冠_x ，_w 可能_h 会_v 引发_v 一些_h 麻烦_k 。_w 所以_c 就是_k 希望_v 他_r 能够_v 理解_v ‘_w 可能_h ’_w 会_v 出现_v 的_u 情况_n ，_w 而_h 不_h 会_v 因此_c 产生_v 不满_v 。_w ”_w \n\n_w 　_w 　_w 记者_n 了解_v 到_v ，_w 对_p 罗比尼奥_x “_w 可能_h 不_h 打_k 亚冠_x ”_w 的_u 说明_v 只是_k 个_q “_w 提醒_v ”_w ，_w 以_p 防止_v 诸如_v 外援_n 对_p 落选_v 失望_a 并且_c 心_k 生_v 不满_v 的_u 情况_n 出现_v ，_w 这_r 在_p 广州恒大淘宝_x 此前_t 的_u 亚冠_x 经历_k 中_n 并_d 不是_n 没有_v 发生_v 过_v 的_u 事情_n ，_w 所以_c 对_p 罗比尼奥_x 的_u 提早_h 说明_h ，_w 就是_k 为了_p 规避_v 恶劣_a 后果_n 的_u 出现_v 。_w 实际上_d 广州恒大淘宝_x 亚冠_x 名单_n 选择_v 中_n 有着_v 高拉特_x 、_w 保利尼奥_x 、_w 埃尔克森_x 、_w 罗比尼奥_x 四_k 人_h ，_w 势必_d 有_v 一_m 人_h 会_v 落选_v 名单_n 。_w 俱乐部_x 也_d 不_h 可能_h 在_p 关键_n 的_u 时候_n 限制_v 罗比尼奥_x 参加_v 亚冠_x ，_w 而_h 给_k 其他_r 三名_mq 外援_n 吃_k 定心丸_n 。_w 如果_c 真_d 按照_v 传言_k 中_f 那样_mq 让_v 罗比尼奥_x 远离_v 亚冠_x ，_w 那么_k 一旦_k 在_p 8月份_t 有_v 一名_mq 外援_n 重伤_k 或者_h 状态_n 不_h 佳_a ，_w 那么_k 对_p 罗比尼奥_x 的_u 限制_v 岂不_d 是_v 搬_v 起_v 石头_x 砸_v 自己_r 的_u 脚_n 。_w 所以_c 四名_mq 外援_n 之间_f 的_u 名额_n 竞争_v 依然_v 存在_k ，_w 只是_k 他们_r 都_n 需要_nz 在_p 一个多_n 月_n 时间_n 里_q 用_v 自己_r 的_u 表现_k 去_h 说服_v 斯科拉里_x 。_w \n");
		String[] feature = {"","et","0.5","井江南", "s", "1", "武当山", "et", "0.1", "鄱阳湖", "et", "0.1", "景德镇", "et", "0.1", "梅兰芳", "et", "0.1", "颐和园", "et", "0.1", "五台山", "et", "0.1", "十二生肖", "et", "0.1", "黄帝", "et", "0.1", "央视记者闹安检","e","0.8"};
		testItem.setFeatures(new ArrayList<String>(Arrays.asList(feature)));
		ob.addDocToSolrByUsingClient(testItem);
	}


	@Ignore
	public void testAddDocToSolr(){
		IKVOperationv2 ikvop = new IKVOperationv2(tablename);
		itemf item = ikvop.queryItemF("1235083", "c");
		ikvop.close();
		ob.addDocToSolr(item);

//		itemf testItem = new itemf();
//		testItem.setID("test");
//		testItem.setDocType("self");
//		testItem.setTitle("《夜行书生》今天的新闻图");
//		testItem.setSplitTitle("《_w 夜行_v 书生_k 》_w 今天_t 的_u 新闻_n 图_k");
//		testItem.setSplitContent("广州日报_x 讯_k  _w （_w 记者_n  _w 李斌_nr ）_w  _w 广州恒大淘宝_x 在_p 夏季_t 转会_k 窗_n 关闭_v 前_f 签_v 下_f 罗比尼奥_x ，_w 但_k 这个_h 消息_n 对_p 目前_t 的_u 球队_x 没有_v 任何_r 帮助_v ，_w 斯科拉里_x 依然_v 只能_d 带着_v 残缺_v 阵容_n 远_k 赴_k 辽宁_x 。_w 今晚_t 7时_t 35分_t ，_w 广州恒大淘宝_x 将_d 在_p 辽宁_x 盘锦_x 奥体_nz 中心_k 对阵_v 辽宁宏运_x 。_w \n\n_w 　_w 　_w 辽宁宏运_x 目前_t 在_p 积分榜_n 的_u 排名_x 不_h 佳_a ，_w 身处_v 降级_v 区_k 边缘_s 。_w 然而_c 这_r 并_d 不是_n 一支_mq 被_p 忽视_v 的_u 对手_n ，_w 辽宁宏运_x 在_p 二次_mq 转会_k 市场_x 引进_v 了_u 罗马尼亚_x 射手_n 埃里克_ns ，_w 同时_k 引进_v 的_u 还有_v 此前_t 效力_h 上海申花_x 的_u 保罗·恩里克_x ，_w 后者_n 在_p 中超联赛_nz 已_h 证明_k 了_u 自己_h 的_u 能力_n 。_w 辽宁宏运_x 在_p 本_r 赛季_n 首_k 次_q 遭遇_h 广州恒大淘宝_x 时_n ，_w 在_p 天河_n 体育场_n 被_p 卡纳瓦罗_x 的_u 球队_x 打出_v 6_mq 比_k 1_mq 的_u 高分_n ，_w 但_k 时过境迁_l ，_w 如今_t 辽宁宏运_x 有着_v 完成_v 保级_v 任务_n 的_u 决心_h ，_w 也_d 能_v 反省_v 此前_t 的_u 战术_n 失误_v ，_w 他们_r 在_p 主场_n 必然_n 将_d 防守_x 反击_x 打_k 得_u 更加_d 坚决_a 。_w \n\n_w 　_w 　_w 斯科拉里_x 面临_v 的_u 依然_v 是_v 无_v 人_r 可用_v 的_u 局面_n ，_w 高拉特_x 在_p 下周_t 才_n 能_v 复出_v ，_w 埃尔克森_x 的_u 伤情_n 可能_v 延续_v 到_v 月底_t 。_w 唯一_b 值得_h 庆幸_a 的_u 是_v ，_w 在_p 经过_v 上_v 轮_v 的_u 临时_d 登场_v 后_f ，_w 保利尼奥_x 的_u 状态_n 看起来_d 可以_v 完成_v 90分钟_mq 的_u 比赛_k ，_w 如今_t 保利尼奥_x 和_c 金英权_x 是_v 斯科拉里_x 在_p 阵容_n 中_n 能_v 使用_v 的_u 外援_n 。_w 而_h 国内_s 球员_n 方面_n ，_w 郑智_x 上_f 轮_v 的_u 红牌_x 使_v 其_u 缺席_v ，_w 郜林_x 从_p 伤病_n 中_n 走出_v 可以_v 一战_x 。_w 广州恒大淘宝_x 在_p 本场_r 比赛_v 的_u 进攻_v 线_k ，_w 依然_v 仰仗_v 于汉超_x 、_w 郑龙_x 与_p 郜林_x 三_m 人_h 。_w “_w 我_r 还_h 没_h 看到_v 罗比尼奥_x ，_w 现在_t 的_u 球员_n 是_v 郜林_x 、_w 黄博文_x 、_w 于汉超_x 等_u 。_w 埃尔克森_x 、_w 张琳芃_x 、_w 廖力生_x 这些_r 球员_n 赶快_d 复出_v ，_w 这_r 是_v 我_r 现在_t 要_v 考虑_v 的_u 。_w ”_w 斯科拉里_x 说_v 。_w 去_h 东北_k 比赛_v 对于_p 斯科拉里_x 而言_u 并_d 没有_v 太_d 大_k 问题_n ，_w 尽管_h 他_r 和_c 球队_x 都_h 乘坐_v 大巴_e 从_p 沈阳_x 前往_v 盘锦_x 。_w 面对_v 保级_v 动力_n 十足_h 的_u 对手_n ，_w 斯科拉里_x 说_v ：_w “_w 我们_r 打_v 任何_r 对手_n 都_n 没有_v 压力_n ，_w 我们_r 需要_v 做_v 的_u 是_v 拿下_v 明天_t 的_u 比赛_k 。_w ”_w \n\n_w 　_w 　_w 罗比_nr 踢_v 亚冠_x  _w 并非_v 没_v 机会_n \n\n_w 　_w 　_w 值得一提的是_nz 罗比尼奥_x ，_w 巴西人_n 目前_t 还_h 未_k 抵达_v 广州_x ，_w 但_k 他_r 的_u 签约_v 有着_v 新_n 的_u 说法_k 。_w 有_v 消息_n 称_k 罗比尼奥_x 的_u 合同_n 中_n 有_v 条款_n 说明_h ，_w 这位_mq 巴西_x 球员_n 只能_d 征战_v 中超_x 而_h 无法_d 登陆_v 亚冠_x 。_w 但_k 记者_n 从_p 相关_v 渠道_n 了解_v 到_v ，_w 这个_h 合同_n 条款_n 的_u 存在_k 仅_k 是_v 规避_v 一些_n 风险_n 。_w “_w 在_p 谈判_v 的_u 时候_n 提出_v 过_u 这个_h 想法_n ，_w 就是_k ‘_w 可能_h 让_v 罗比尼奥_x 只_k 踢_v 中超_x ’_w ，_w 希望_k 罗比尼奥_x 能_v 接受_v 这个_h 条件_n 。_w 罗比尼奥_x 最终_b 答应_v 了_u 。_w 这个_h 条件_n 虽然_c 看起来_d 有些_h 苛刻_k ，_w 但_k 却_k 并_h 不是_n 说_v 他_r 只能_d 踢_v 中超_x 。_w ”_w \n\n_w 　_w 　_w 知情人士_nz 表示_k 说_v ，_w “_w 条款_n 的_u 存在_k 是_v 一种_mq 安抚_v ，_w 因为_c 球队_x 肯定_k 只有_c 三名_mq 非_h 亚_h 外援_n 报名_v 亚冠_x 。_w 按照_v 罗比尼奥_x 的_u 身价_n 和_c 名气_n ，_w 如果_c 他_r 没_v 法_v 报名_v 亚冠_x ，_w 可能_h 会_v 引发_v 一些_h 麻烦_k 。_w 所以_c 就是_k 希望_v 他_r 能够_v 理解_v ‘_w 可能_h ’_w 会_v 出现_v 的_u 情况_n ，_w 而_h 不_h 会_v 因此_c 产生_v 不满_v 。_w ”_w \n\n_w 　_w 　_w 记者_n 了解_v 到_v ，_w 对_p 罗比尼奥_x “_w 可能_h 不_h 打_k 亚冠_x ”_w 的_u 说明_v 只是_k 个_q “_w 提醒_v ”_w ，_w 以_p 防止_v 诸如_v 外援_n 对_p 落选_v 失望_a 并且_c 心_k 生_v 不满_v 的_u 情况_n 出现_v ，_w 这_r 在_p 广州恒大淘宝_x 此前_t 的_u 亚冠_x 经历_k 中_n 并_d 不是_n 没有_v 发生_v 过_v 的_u 事情_n ，_w 所以_c 对_p 罗比尼奥_x 的_u 提早_h 说明_h ，_w 就是_k 为了_p 规避_v 恶劣_a 后果_n 的_u 出现_v 。_w 实际上_d 广州恒大淘宝_x 亚冠_x 名单_n 选择_v 中_n 有着_v 高拉特_x 、_w 保利尼奥_x 、_w 埃尔克森_x 、_w 罗比尼奥_x 四_k 人_h ，_w 势必_d 有_v 一_m 人_h 会_v 落选_v 名单_n 。_w 俱乐部_x 也_d 不_h 可能_h 在_p 关键_n 的_u 时候_n 限制_v 罗比尼奥_x 参加_v 亚冠_x ，_w 而_h 给_k 其他_r 三名_mq 外援_n 吃_k 定心丸_n 。_w 如果_c 真_d 按照_v 传言_k 中_f 那样_mq 让_v 罗比尼奥_x 远离_v 亚冠_x ，_w 那么_k 一旦_k 在_p 8月份_t 有_v 一名_mq 外援_n 重伤_k 或者_h 状态_n 不_h 佳_a ，_w 那么_k 对_p 罗比尼奥_x 的_u 限制_v 岂不_d 是_v 搬_v 起_v 石头_x 砸_v 自己_r 的_u 脚_n 。_w 所以_c 四名_mq 外援_n 之间_f 的_u 名额_n 竞争_v 依然_v 存在_k ，_w 只是_k 他们_r 都_n 需要_nz 在_p 一个多_n 月_n 时间_n 里_q 用_v 自己_r 的_u 表现_k 去_h 说服_v 斯科拉里_x 。_w \n");
//		ob.addDocToSolr(testItem);
	}
	@Ignore
	public void testDeleteAll(){
//		ob.deleteAll();
	}
	@Ignore
	public void testDeleteSolrById(){
		ob.deleteSolrById("test");
	}
	@Ignore
	public void testDeleteSolrByIds(){
		/*BufferedReader rd = null;
		try {
			rd = new BufferedReader(new InputStreamReader(new FileInputStream(
					"D:\\yidianLocals.txt"), "UTF8"));
			String line = null;
			int i = 0;
			String[] ids = new String[1000];
			while ((line = rd.readLine()) != null && !line.isEmpty()) {
				ids[i % 1000] = line;
//				i++;
				if(i % 1000 == 999)
					ob.deleteSolrByIds(ids);
				i++;
			}
			ob.deleteSolrByIds(ids);
		} catch (FileNotFoundException e) {
			e.printStackTrace();
		} catch (IOException e1) {
			e1.printStackTrace();
		} finally {
			if (rd != null) {
				try {
					rd.close();
				} catch (IOException e) {
					e.printStackTrace();
				}
			}
		}*/
		String[] ids = { "1914490", "1520762", "1520761" };
//		ob.deleteSolrByIds(ids);
	}
	
	@Test
	public void testQueryByIds(){
		List<itemf> itemList = ob.queryByIds(2500000, 2500185);
		assertNotNull(itemList);
		assertEquals(itemList.size(), 186);
	}
}
